/*--------------------------------------------------------------------------------------------------------------------------------------------------------------
Файл распространяется под лицензией GPL-3.0-or-later, https://www.gnu.org/licenses/gpl-3.0.txt
----------------------------------------------------------------------------------------------------------------------------------------------------------------
xx.xx.2022	konstantin@5277.ru			Начало
--------------------------------------------------------------------------------------------------------------------------------------------------------------*/
package ru.pp.w5277c.yaji.components;

public class JREComponent extends Component {
	public JREComponent(String l_path, String l_name, String l_comment, String l_version, boolean l_mandatory) {
		super(l_path, l_name, l_comment, l_version, l_mandatory);
	}
}
